app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "asa"], ["password_digest", "$2a$10$dZJqVUKSjJLRGl/p5W08fevJNGQ9E7VP75iECcESLw5rs1JtAL3dK"], ["created_at", "2015-10-16 03:12:42.422729"], ["updated_at", "2015-10-16 03:12:42.422729"]]
---
	def create
		@users =  User.new(user_params)
		if @users.save